 
let data = [
  {
    id: 1,
    title: "ایتم شماره ی 1",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است ",
  },
  {
    id: 2,
    title: "ایتم شماره ی 2",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است ",
  },
  {
    id: 3,
    title: "ایتم شماره ی 3",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است ",
  },
  {
    id: 4,
    title: "ایتم شماره ی 4",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است ",
  },
  {
    id: 5,
    title: "ایتم شماره ی 5",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است ",
  },
  {
    id: 6,
    title: "ایتم شماره ی 6",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است ",
  },
];

new draggabe({
  element: document.querySelector("#list"),
  list: data,
  template: (item) => {
    return`<div class="list-item" id="${item.id}">
                    <div class="list-item_head">
                    <span class="head-id">${item.id}</span>
                    </div>
                    <div class="list-item_content">
                    <span class="item-title">${item.title}</span>
                    <p>${item.text}</p>
                </div>
            </div>`;
  },

  updated: (list) => {
    console.log(list);
  },
});
